src/Documents/НДФЛВозвратНалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>НДФЛВозвратНалога</Name>
			<Comment>(Регл)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НДФЛРасчетыСБюджетом</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСРаботникамиОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.НДФЛКЗачету</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцНалоговогоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаботникиОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВозвратаПоСтавке13</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВозвратаПоСтавке09</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВозвратаПоСтавке35</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодПоОКАТО</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПП</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВозвратаПоСтавке40</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВозвратаПоСтавке9</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеОрганизации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/НДФЛРасчетыСБюджетом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>НДФЛРасчетыСБюджетом</Name>
			<Comment>(Регл)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Налог</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПримененныйВычетЛичный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПримененныйВычетНаДетей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПримененныйВычетНаДетейИнвалидов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПримененныйВычетНаДетейЛьгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПримененныйДополнительныйВычет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПримененныйВычетМолодыеСпециалисты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтроки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НДФЛРасчетыСБюджетомВидСтроки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсчисленоИзЗарплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНалогообложенияРезидента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НДФЛСтавкиНалогообложенияРезидента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНалоговогоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/НДФЛКЗачету.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>НДФЛКЗачету</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНДФЛКЗачету</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНалогообложенияРезидента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НДФЛСтавкиНалогообложенияРезидента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ВзаиморасчетыСРаботникамиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСРаботникамиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХарактерВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХарактерВыплатыЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыплатыЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ведомость</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗарплатаКВыплатеОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/НДФЛСтавкиНалогообложенияРезидента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>НДФЛСтавкиНалогообложенияРезидента</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ставка13</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка09</Name>
					<Comment>Дивиденты и приравненные к ним доходы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка35</Name>
					<Comment>Доходы по неосновному месту работы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка9</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка40</Name>
					<Comment>Доходы наследников авторских вознаграждений</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОблагается</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/НДФЛРасчетыСБюджетомВидСтроки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>НДФЛРасчетыСБюджетомВидСтроки</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удержание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоНаВзыскание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/НДФЛВозвратНалога/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Выполняет расчет налога для указанного списка физлиц 
Процедура Рассчитать() Экспорт

	Запрос = Новый Запрос;
	
	ЭтоЮрЛицо = Организация.ЮрФизЛицо <> Перечисления.ЮрФизЛицо.ФизЛицо;
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	Запрос.УстановитьПараметр("МесяцНалоговогоПериода", КонецМесяца(МесяцНалоговогоПериода));
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("Ставка13", Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13);
	Запрос.УстановитьПараметр("Ставка09", Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка09);
	Запрос.УстановитьПараметр("Ставка35", Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка35);
	
	// Выбор сальдо на дату документа с учетом всех "МесяцевНалоговогоПериода" < МесяцНалоговогоПериода
	// Интересует только отрицательное сальдо по налогу, т.е. когда удержано больше чем начислено
	
	Если ЭтоЮрЛицо Тогда
		
		Запрос.УстановитьПараметр("ПустойКодПоОКАТО","");
		Запрос.УстановитьПараметр("ПустойКПП","");
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА СальдоПоСтавкам.СальдоПоСтавке13 < 0
		|			ТОГДА -СальдоПоСтавкам.СальдоПоСтавке13
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаВозвратаПоСтавке13,
		|	ВЫБОР
		|		КОГДА СальдоПоСтавкам.СальдоПоСтавке09 < 0
		|			ТОГДА -СальдоПоСтавкам.СальдоПоСтавке09
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаВозвратаПоСтавке09,
		|	ВЫБОР
		|		КОГДА СальдоПоСтавкам.СальдоПоСтавке35 < 0
		|			ТОГДА -СальдоПоСтавкам.СальдоПоСтавке35
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаВозвратаПоСтавке35,
		|	НДФЛВозвратНалогаРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
		|	НДФЛВозвратНалогаРаботникиОрганизации.ФизЛицо,
		|	НДФЛВозвратНалогаРаботникиОрганизации.КодПоОКАТО,
		|	НДФЛВозвратНалогаРаботникиОрганизации.КПП
		|ИЗ
		|	Документ.НДФЛВозвратНалога.РаботникиОрганизации КАК НДФЛВозвратНалогаРаботникиОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			НДФЛРасчетыСБюджетом.ФизЛицо КАК ФизЛицо,
		|			СУММА(ВЫБОР
		|					КОГДА НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = &Ставка13
		|						ТОГДА ВЫБОР
		|								КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|									ТОГДА НДФЛРасчетыСБюджетом.Налог
		|								ИНАЧЕ -НДФЛРасчетыСБюджетом.Налог
		|							КОНЕЦ
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК СальдоПоСтавке13,
		|			СУММА(ВЫБОР
		|					КОГДА НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = &Ставка09
		|						ТОГДА ВЫБОР
		|								КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|									ТОГДА НДФЛРасчетыСБюджетом.Налог
		|								ИНАЧЕ -НДФЛРасчетыСБюджетом.Налог
		|							КОНЕЦ
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК СальдоПоСтавке09,
		|			СУММА(ВЫБОР
		|					КОГДА НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = &Ставка35
		|						ТОГДА ВЫБОР
		|								КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|									ТОГДА НДФЛРасчетыСБюджетом.Налог
		|								ИНАЧЕ -НДФЛРасчетыСБюджетом.Налог
		|							КОНЕЦ
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК СальдоПоСтавке35,
		|			ВЫБОР
		|				КОГДА НДФЛРасчетыСБюджетом.КодПоОКАТО <> &ПустойКодПоОКАТО
		|					ТОГДА НДФЛРасчетыСБюджетом.КодПоОКАТО
		|				КОГДА ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КодПоОКАТО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
		|					ТОГДА НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КодПоОКАТО
		|				ИНАЧЕ ЕСТЬNULL(НДФЛРасчетыСБюджетом.ОбособленноеПодразделение.КодПоОКАТО, &ПустойКодПоОКАТО)
		|			КОНЕЦ КАК КодПоОКАТО,
		|			ВЫБОР
		|				КОГДА НДФЛРасчетыСБюджетом.КПП <> &ПустойКПП
		|					ТОГДА НДФЛРасчетыСБюджетом.КПП
		|				КОГДА ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КПП, &ПустойКПП) <> &ПустойКПП
		|					ТОГДА НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КПП
		|				ИНАЧЕ ЕСТЬNULL(НДФЛРасчетыСБюджетом.ОбособленноеПодразделение.КПП, &ПустойКПП)
		|			КОНЕЦ КАК КПП
		|		ИЗ
		|			РегистрНакопления.НДФЛРасчетыСБюджетом КАК НДФЛРасчетыСБюджетом
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					НДФЛВозвратНалогаРаботникиОрганизации.ФизЛицо КАК ФизЛицо
		|				ИЗ
		|					Документ.НДФЛВозвратНалога.РаботникиОрганизации КАК НДФЛВозвратНалогаРаботникиОрганизации
		|				ГДЕ
		|					НДФЛВозвратНалогаРаботникиОрганизации.Ссылка = &ДокументСсылка) КАК НДФЛВозвратНалогаРаботникиОрганизации
		|				ПО НДФЛВозвратНалогаРаботникиОрганизации.ФизЛицо = НДФЛРасчетыСБюджетом.ФизЛицо
		|		ГДЕ
		|			НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода <= &МесяцНалоговогоПериода
		|			И НДФЛРасчетыСБюджетом.Организация = &ГоловнаяОрганизация
		|			И НДФЛРасчетыСБюджетом.Период <= &ДатаДокумента
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВЫБОР
		|				КОГДА НДФЛРасчетыСБюджетом.КПП <> &ПустойКПП
		|					ТОГДА НДФЛРасчетыСБюджетом.КПП
		|				КОГДА ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КПП, &ПустойКПП) <> &ПустойКПП
		|					ТОГДА НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КПП
		|				ИНАЧЕ ЕСТЬNULL(НДФЛРасчетыСБюджетом.ОбособленноеПодразделение.КПП, &ПустойКПП)
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА НДФЛРасчетыСБюджетом.КодПоОКАТО <> &ПустойКодПоОКАТО
		|					ТОГДА НДФЛРасчетыСБюджетом.КодПоОКАТО
		|				КОГДА ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КодПоОКАТО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
		|					ТОГДА НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КодПоОКАТО
		|				ИНАЧЕ ЕСТЬNULL(НДФЛРасчетыСБюджетом.ОбособленноеПодразделение.КодПоОКАТО, &ПустойКодПоОКАТО)
		|			КОНЕЦ,
		|			НДФЛРасчетыСБюджетом.ФизЛицо) КАК СальдоПоСтавкам
		|		ПО НДФЛВозвратНалогаРаботникиОрганизации.ФизЛицо = СальдоПоСтавкам.ФизЛицо
		|			И НДФЛВозвратНалогаРаботникиОрганизации.КодПоОКАТО = СальдоПоСтавкам.КодПоОКАТО
		|			И НДФЛВозвратНалогаРаботникиОрганизации.КПП = СальдоПоСтавкам.КПП
		|			И (СальдоПоСтавкам.СальдоПоСтавке13 < 0
		|				ИЛИ СальдоПоСтавкам.СальдоПоСтавке09 < 0
		|				ИЛИ СальдоПоСтавкам.СальдоПоСтавке35 < 0)
		|ГДЕ
		|	НДФЛВозвратНалогаРаботникиОрганизации.Ссылка = &ДокументСсылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СальдоПоСтавкам.НомерСтроки КАК НомерСтроки,
		|	СальдоПоСтавкам.ФизЛицо,
		|	СУММА(СальдоПоСтавкам.СальдоПоСтавке13) КАК СуммаВозвратаПоСтавке13,
		|	СУММА(СальдоПоСтавкам.СальдоПоСтавке09) КАК СуммаВозвратаПоСтавке09,
		|	СУММА(СальдоПоСтавкам.СальдоПоСтавке35) КАК СуммаВозвратаПоСтавке35
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
		|		ТЧРаботникиОрганизации.ФизЛицо КАК ФизЛицо,
		|		НДФЛРасчетыСБюджетомОстатки.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|		ВЫБОР
		|			КОГДА НДФЛРасчетыСБюджетомОстатки.СтавкаНалогообложенияРезидента = &Ставка13
		|				ТОГДА -НДФЛРасчетыСБюджетомОстатки.НалогОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК СальдоПоСтавке13,
		|		ВЫБОР
		|			КОГДА НДФЛРасчетыСБюджетомОстатки.СтавкаНалогообложенияРезидента = &Ставка09
		|				ТОГДА -НДФЛРасчетыСБюджетомОстатки.НалогОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК СальдоПоСтавке09,
		|		ВЫБОР
		|			КОГДА НДФЛРасчетыСБюджетомОстатки.СтавкаНалогообложенияРезидента = &Ставка35
		|				ТОГДА -НДФЛРасчетыСБюджетомОстатки.НалогОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК СальдоПоСтавке35
		|	ИЗ
		|		Документ.НДФЛВозвратНалога.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НДФЛРасчетыСБюджетом.Остатки(
		|			&ДатаДокумента,
		|			Организация = &ГоловнаяОрганизация
		|				И МесяцНалоговогоПериода <= &МесяцНалоговогоПериода
		|				И ФизЛицо В
		|					(ВЫБРАТЬ
		|						ТЧ.ФизЛицо
		|					ИЗ
		|						Документ.НДФЛВозвратНалога.РаботникиОрганизации КАК ТЧ
		|					ГДЕ
		|						ТЧ.Ссылка = &ДокументСсылка)) КАК НДФЛРасчетыСБюджетомОстатки
		|			ПО ТЧРаботникиОрганизации.ФизЛицо = НДФЛРасчетыСБюджетомОстатки.ФизЛицо
		|	ГДЕ
		|		ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
		|		И НДФЛРасчетыСБюджетомОстатки.НалогОстаток < 0) КАК СальдоПоСтавкам
		|
		|СГРУППИРОВАТЬ ПО
		|	СальдоПоСтавкам.НомерСтроки,
		|	СальдоПоСтавкам.ФизЛицо
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
	КонецЕсли;
				   
	РаботникиОрганизации.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

// Заполняет табличную часть документа отпусками по графику отпусков
//
// Параметры
//  ДатаНачала, ДатаОкончания – даты начала и окончания 
//								просмотра графика отпусков	
//
Процедура Автозаполнение() Экспорт
	
	Запрос = Новый Запрос;
	
	ЭтоЮрЛицо = Организация.ЮрФизЛицо <> Перечисления.ЮрФизЛицо.ФизЛицо;
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",	ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("МесяцНалоговогоПериода",	КонецМесяца(МесяцНалоговогоПериода));
	Запрос.УстановитьПараметр("ДатаДокумента",			Дата);
	Запрос.УстановитьПараметр("Ставка13",				Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13);
	Запрос.УстановитьПараметр("Ставка09",				Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка09);
	Запрос.УстановитьПараметр("Ставка35",				Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка35);
	Запрос.УстановитьПараметр("Ставка9",				Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка9);
	Запрос.УстановитьПараметр("Ставка40",				Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка40);
	Запрос.УстановитьПараметр("парамПриход",			ВидДвиженияНакопления.Приход);
	
	Если ЭтоЮрЛицо Тогда
		Запрос.УстановитьПараметр("ПустойКодПоОКАТО","");
		Запрос.УстановитьПараметр("ПустойКПП","");
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СальдоПоСтавкам.ФизЛицо,
		|	СальдоПоСтавкам.КодПоОКАТО,
		|	СальдоПоСтавкам.КПП,
		|	ВЫБОР
		|		КОГДА СальдоПоСтавкам.СальдоПоСтавке13 < 0
		|			ТОГДА -СальдоПоСтавкам.СальдоПоСтавке13
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаВозвратаПоСтавке13,
		|	ВЫБОР
		|		КОГДА СальдоПоСтавкам.СальдоПоСтавке09 < 0
		|			ТОГДА -СальдоПоСтавкам.СальдоПоСтавке09
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаВозвратаПоСтавке09,
		|	ВЫБОР
		|		КОГДА СальдоПоСтавкам.СальдоПоСтавке35 < 0
		|			ТОГДА -СальдоПоСтавкам.СальдоПоСтавке35
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаВозвратаПоСтавке35,
		|	ВЫБОР
		|		КОГДА СальдоПоСтавкам.СальдоПоСтавке9 < 0
		|			ТОГДА -СальдоПоСтавкам.СальдоПоСтавке9
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаВозвратаПоСтавке9,
		|	ВЫБОР
		|		КОГДА СальдоПоСтавкам.СальдоПоСтавке40 < 0
		|			ТОГДА -СальдоПоСтавкам.СальдоПоСтавке40
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаВозвратаПоСтавке40
		|ИЗ
		|	(ВЫБРАТЬ
		|		НДФЛРасчетыСБюджетом.ФизЛицо КАК ФизЛицо,
		|		СУММА(ВЫБОР
		|				КОГДА НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = &Ставка13
		|					ТОГДА ВЫБОР
		|							КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = &парамПриход
		|								ТОГДА НДФЛРасчетыСБюджетом.Налог
		|							ИНАЧЕ -НДФЛРасчетыСБюджетом.Налог
		|						КОНЕЦ
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК СальдоПоСтавке13,
		|		СУММА(ВЫБОР
		|				КОГДА НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = &Ставка09
		|					ТОГДА ВЫБОР
		|							КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = &парамПриход
		|								ТОГДА НДФЛРасчетыСБюджетом.Налог
		|							ИНАЧЕ -НДФЛРасчетыСБюджетом.Налог
		|						КОНЕЦ
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК СальдоПоСтавке09,
		|		СУММА(ВЫБОР
		|				КОГДА НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = &Ставка35
		|					ТОГДА ВЫБОР
		|							КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = &парамПриход
		|								ТОГДА НДФЛРасчетыСБюджетом.Налог
		|							ИНАЧЕ -НДФЛРасчетыСБюджетом.Налог
		|						КОНЕЦ
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК СальдоПоСтавке35,
		|		СУММА(ВЫБОР
		|				КОГДА НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = &Ставка9
		|					ТОГДА ВЫБОР
		|							КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = &парамПриход
		|								ТОГДА НДФЛРасчетыСБюджетом.Налог
		|							ИНАЧЕ -НДФЛРасчетыСБюджетом.Налог
		|						КОНЕЦ
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК СальдоПоСтавке9,
		|		СУММА(ВЫБОР
		|				КОГДА НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = &Ставка40
		|					ТОГДА ВЫБОР
		|							КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = &парамПриход
		|								ТОГДА НДФЛРасчетыСБюджетом.Налог
		|							ИНАЧЕ -НДФЛРасчетыСБюджетом.Налог
		|						КОНЕЦ
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК СальдоПоСтавке40,
		|		ВЫБОР
		|			КОГДА НДФЛРасчетыСБюджетом.КодПоОКАТО <> &ПустойКодПоОКАТО
		|				ТОГДА НДФЛРасчетыСБюджетом.КодПоОКАТО
		|			КОГДА ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КодПоОКАТО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
		|				ТОГДА НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КодПоОКАТО
		|			ИНАЧЕ ЕСТЬNULL(НДФЛРасчетыСБюджетом.ОбособленноеПодразделение.КодПоОКАТО, &ПустойКодПоОКАТО)
		|		КОНЕЦ КАК КодПоОКАТО,
		|		ВЫБОР
		|			КОГДА НДФЛРасчетыСБюджетом.КПП <> &ПустойКПП
		|				ТОГДА НДФЛРасчетыСБюджетом.КПП
		|			КОГДА ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КПП, &ПустойКПП) <> &ПустойКПП
		|				ТОГДА НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КПП
		|			ИНАЧЕ ЕСТЬNULL(НДФЛРасчетыСБюджетом.ОбособленноеПодразделение.КПП, &ПустойКПП)
		|		КОНЕЦ КАК КПП
		|	ИЗ
		|		РегистрНакопления.НДФЛРасчетыСБюджетом КАК НДФЛРасчетыСБюджетом
		|	ГДЕ
		|		НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода <= &МесяцНалоговогоПериода
		|		И НДФЛРасчетыСБюджетом.Организация = &ГоловнаяОрганизация
		|		И НДФЛРасчетыСБюджетом.Период <= &ДатаДокумента
		|	
		|	СГРУППИРОВАТЬ ПО
		|		НДФЛРасчетыСБюджетом.ФизЛицо,
		|		ВЫБОР
		|			КОГДА НДФЛРасчетыСБюджетом.КПП <> &ПустойКПП
		|				ТОГДА НДФЛРасчетыСБюджетом.КПП
		|			КОГДА ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КПП, &ПустойКПП) <> &ПустойКПП
		|				ТОГДА НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КПП
		|			ИНАЧЕ ЕСТЬNULL(НДФЛРасчетыСБюджетом.ОбособленноеПодразделение.КПП, &ПустойКПП)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА НДФЛРасчетыСБюджетом.КодПоОКАТО <> &ПустойКодПоОКАТО
		|				ТОГДА НДФЛРасчетыСБюджетом.КодПоОКАТО
		|			КОГДА ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КодПоОКАТО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
		|				ТОГДА НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КодПоОКАТО
		|			ИНАЧЕ ЕСТЬNULL(НДФЛРасчетыСБюджетом.ОбособленноеПодразделение.КодПоОКАТО, &ПустойКодПоОКАТО)
		|		КОНЕЦ) КАК СальдоПоСтавкам
		|ГДЕ
		|	(СальдоПоСтавкам.СальдоПоСтавке13 < 0
		|			ИЛИ СальдоПоСтавкам.СальдоПоСтавке09 < 0
		|			ИЛИ СальдоПоСтавкам.СальдоПоСтавке35 < 0
		|			ИЛИ СальдоПоСтавкам.СальдоПоСтавке9 < 0
		|			ИЛИ СальдоПоСтавкам.СальдоПоСтавке40 < 0)";
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СальдоПоСтавкам.ФизЛицо,
		|	ВЫБОР
		|		КОГДА СальдоПоСтавкам.СальдоПоСтавке13 < 0
		|			ТОГДА -СальдоПоСтавкам.СальдоПоСтавке13
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаВозвратаПоСтавке13,
		|	ВЫБОР
		|		КОГДА СальдоПоСтавкам.СальдоПоСтавке09 < 0
		|			ТОГДА -СальдоПоСтавкам.СальдоПоСтавке09
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаВозвратаПоСтавке09,
		|	ВЫБОР
		|		КОГДА СальдоПоСтавкам.СальдоПоСтавке35 < 0
		|			ТОГДА -СальдоПоСтавкам.СальдоПоСтавке35
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаВозвратаПоСтавке35,
		|	ВЫБОР
		|		КОГДА СальдоПоСтавкам.СальдоПоСтавке9 < 0
		|			ТОГДА -СальдоПоСтавкам.СальдоПоСтавке9
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаВозвратаПоСтавке9,
		|	ВЫБОР
		|		КОГДА СальдоПоСтавкам.СальдоПоСтавке40 < 0
		|			ТОГДА -СальдоПоСтавкам.СальдоПоСтавке40
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаВозвратаПоСтавке40
		|ИЗ
		|	(ВЫБРАТЬ
		|		НДФЛРасчетыСБюджетом.ФизЛицо КАК ФизЛицо,
		|		СУММА(ВЫБОР
		|				КОГДА НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = &Ставка13
		|					ТОГДА ВЫБОР
		|							КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = &парамПриход
		|								ТОГДА НДФЛРасчетыСБюджетом.Налог
		|							ИНАЧЕ -НДФЛРасчетыСБюджетом.Налог
		|						КОНЕЦ
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК СальдоПоСтавке13,
		|		СУММА(ВЫБОР
		|				КОГДА НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = &Ставка09
		|					ТОГДА ВЫБОР
		|							КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = &парамПриход
		|								ТОГДА НДФЛРасчетыСБюджетом.Налог
		|							ИНАЧЕ -НДФЛРасчетыСБюджетом.Налог
		|						КОНЕЦ
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК СальдоПоСтавке09,
		|		СУММА(ВЫБОР
		|				КОГДА НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = &Ставка35
		|					ТОГДА ВЫБОР
		|							КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = &парамПриход
		|								ТОГДА НДФЛРасчетыСБюджетом.Налог
		|							ИНАЧЕ -НДФЛРасчетыСБюджетом.Налог
		|						КОНЕЦ
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК СальдоПоСтавке35,
		|		СУММА(ВЫБОР
		|				КОГДА НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = &Ставка9
		|					ТОГДА ВЫБОР
		|							КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = &парамПриход
		|								ТОГДА НДФЛРасчетыСБюджетом.Налог
		|							ИНАЧЕ -НДФЛРасчетыСБюджетом.Налог
		|						КОНЕЦ
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК СальдоПоСтавке9,
		|		СУММА(ВЫБОР
		|				КОГДА НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = &Ставка40
		|					ТОГДА ВЫБОР
		|							КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = &парамПриход
		|								ТОГДА НДФЛРасчетыСБюджетом.Налог
		|							ИНАЧЕ -НДФЛРасчетыСБюджетом.Налог
		|						КОНЕЦ
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК СальдоПоСтавке40
		|	ИЗ
		|		РегистрНакопления.НДФЛРасчетыСБюджетом КАК НДФЛРасчетыСБюджетом
		|	ГДЕ
		|		НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода <= &МесяцНалоговогоПериода
		|		И НДФЛРасчетыСБюджетом.Организация = &ГоловнаяОрганизация
		|		И НДФЛРасчетыСБюджетом.Период <= &ДатаДокумента
		|	
		|	СГРУППИРОВАТЬ ПО
		|		НДФЛРасчетыСБюджетом.ФизЛицо) КАК СальдоПоСтавкам
		|ГДЕ
		|	(СальдоПоСтавкам.СальдоПоСтавке13 < 0
		|			ИЛИ СальдоПоСтавкам.СальдоПоСтавке09 < 0
		|			ИЛИ СальдоПоСтавкам.СальдоПоСтавке35 < 0
		|			ИЛИ СальдоПоСтавкам.СальдоПоСтавке9 < 0
		|			ИЛИ СальдоПоСтавкам.СальдоПоСтавке40 < 0)";
		
	КонецЕсли;
	
	РаботникиОрганизации.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры // Автозаполнение()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке(Режим)

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);

	Запрос.Текст = 
	"ВЫБРАТЬ
//толик изменил на клнец периода
	|	КОНЕЦПЕРИОДА(НДФЛВозвратНалога.Дата, МЕСЯЦ) КАК Дата,
	|	НДФЛВозвратНалога.Ссылка,
	|	НДФЛВозвратНалога.МесяцНалоговогоПериода,
	|	НДФЛВозвратНалога.Организация,
	|	ВЫБОР
	|		КОГДА НДФЛВозвратНалога.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НДФЛВозвратНалога.Организация
	|		ИНАЧЕ НДФЛВозвратНалога.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация
	|ИЗ
	|	Документ.НДФЛВозвратНалога КАК НДФЛВозвратНалога
	|ГДЕ
	|	НДФЛВозвратНалога.Ссылка = &ДокументСсылка";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

// Формирует запрос по табличной части документам
//
// Параметры: 
//  Режим        - режим проведения.
//
// Возвращаемое значение:
//  Результат запроса.
//
Функция СформироватьЗапросПоРаботникиОрганизации(Режим)

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НДФЛВозвратНалогаРаботникиОрганизации.НомерСтроки,
	|	НДФЛВозвратНалогаРаботникиОрганизации.ФизЛицо,
	|	НДФЛВозвратНалогаРаботникиОрганизации.СуммаВозвратаПоСтавке13,
	|	НДФЛВозвратНалогаРаботникиОрганизации.СуммаВозвратаПоСтавке09,
	|	НДФЛВозвратНалогаРаботникиОрганизации.СуммаВозвратаПоСтавке35,
	|	НДФЛВозвратНалогаРаботникиОрганизации.СуммаВозвратаПоСтавке9,
	|	НДФЛВозвратНалогаРаботникиОрганизации.СуммаВозвратаПоСтавке40
	//|	НДФЛВозвратНалогаРаботникиОрганизации.КодПоОКАТО,
	//|	НДФЛВозвратНалогаРаботникиОрганизации.КПП
	|ИЗ
	|	Документ.НДФЛВозвратНалога.РаботникиОрганизации КАК НДФЛВозвратНалогаРаботникиОрганизации
	|ГДЕ
	|	НДФЛВозвратНалогаРаботникиОрганизации.Ссылка = &ДокументСсылка";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 		 - флаг отказа в проведении,
//	Заголовок	 - Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок)

	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация!", Отказ, Заголовок);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.МесяцНалоговогоПериода) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан период, за который возвращается налог!", Отказ, Заголовок);
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения строки документа.
Процедура ПроверитьЗаполнениеСтрокиРаботникиОрганизации(ВыборкаПоРаботникиОрганизации, Отказ, Заголовок)

		НачалоСообщения = "В строке № """+ СокрЛП(ВыборкаПоРаботникиОрганизации.НомерСтроки) +
									""" табл. части ""Работники организации"": ";
									
		Если НЕ ЗначениеЗаполнено(ВыборкаПоРаботникиОрганизации.ФизЛицо) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НачалоСообщения + "не указано физическое лицо!", Отказ, Заголовок);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ВыборкаПоРаботникиОрганизации.СуммаВозвратаПоСтавке13 + ВыборкаПоРаботникиОрганизации.СуммаВозвратаПоСтавке09 + ВыборкаПоРаботникиОрганизации.СуммаВозвратаПоСтавке35 + ВыборкаПоРаботникиОрганизации.СуммаВозвратаПоСтавке9 + ВыборкаПоРаботникиОрганизации.СуммаВозвратаПоСтавке40) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НачалоСообщения + "не указаны суммы возврата налога!", Отказ, Заголовок);
		КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиРаботникиОрганизации()

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоШапкеДокумента                  - выборка из результата запроса по шапке документа
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаПоТЧ, УчетЗадолженностиПоМесяцам)
	
	// Проведем возврат как отрицательный расход (отрицательное удержание налога) отдельно для каждой ставки
	
	Если ВыборкаПоТЧ.СуммаВозвратаПоСтавке13 <> 0 Тогда
		Движение = Движения.НДФЛКЗачету.Добавить();
		// Свойства
		Движение.Период                 = ВыборкаПоШапкеДокумента.Дата;
		Движение.ВидДвижения			= ВидДвиженияНакопления.Расход;
		// Измерения
		Движение.Организация			        = ВыборкаПоШапкеДокумента.Организация;
		Движение.ФизЛицо                        = ВыборкаПоТЧ.ФизЛицо;
		Движение.СтавкаНалогообложенияРезидента = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13;
		
		// Ресурсы
		Движение.СуммаНДФЛКЗачету = ВыборкаПоТЧ.СуммаВозвратаПоСтавке13;
	КонецЕсли;
	
	Если ВыборкаПоТЧ.СуммаВозвратаПоСтавке09 <> 0 Тогда
		Движение = Движения.НДФЛКЗачету.Добавить();
		// Свойства
		Движение.Период                 = ВыборкаПоШапкеДокумента.Дата;
		Движение.ВидДвижения			= ВидДвиженияНакопления.Расход;
		// Измерения
		Движение.Организация			        = ВыборкаПоШапкеДокумента.Организация;
		Движение.ФизЛицо                        = ВыборкаПоТЧ.ФизЛицо;
		Движение.СтавкаНалогообложенияРезидента = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка09;
		
		// Ресурсы
		Движение.СуммаНДФЛКЗачету = ВыборкаПоТЧ.СуммаВозвратаПоСтавке09;
	КонецЕсли;
	
	Если ВыборкаПоТЧ.СуммаВозвратаПоСтавке35 <> 0 Тогда
		Движение = Движения.НДФЛКЗачету.Добавить();
		// Свойства
		Движение.Период                 = ВыборкаПоШапкеДокумента.Дата;
		Движение.ВидДвижения			= ВидДвиженияНакопления.Расход;
		// Измерения
		Движение.Организация			        = ВыборкаПоШапкеДокумента.Организация;
		Движение.ФизЛицо                        = ВыборкаПоТЧ.ФизЛицо;
		Движение.СтавкаНалогообложенияРезидента = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка35;
		
		// Ресурсы
		Движение.СуммаНДФЛКЗачету = ВыборкаПоТЧ.СуммаВозвратаПоСтавке35;
	КонецЕсли;
	
	Если ВыборкаПоТЧ.СуммаВозвратаПоСтавке9 <> 0 Тогда
		Движение = Движения.НДФЛКЗачету.Добавить();
		// Свойства
		Движение.Период                 = ВыборкаПоШапкеДокумента.Дата;
		Движение.ВидДвижения			= ВидДвиженияНакопления.Расход;
		// Измерения
		Движение.Организация			        = ВыборкаПоШапкеДокумента.Организация;
		Движение.ФизЛицо                        = ВыборкаПоТЧ.ФизЛицо;
		Движение.СтавкаНалогообложенияРезидента = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка9;
		
		// Ресурсы
		Движение.СуммаНДФЛКЗачету = ВыборкаПоТЧ.СуммаВозвратаПоСтавке9;
	КонецЕсли;
	
	Если ВыборкаПоТЧ.СуммаВозвратаПоСтавке40 <> 0 Тогда
		Движение = Движения.НДФЛКЗачету.Добавить();
		// Свойства
		Движение.Период                 = ВыборкаПоШапкеДокумента.Дата;
		Движение.ВидДвижения			= ВидДвиженияНакопления.Расход;
		// Измерения
		Движение.Организация			        = ВыборкаПоШапкеДокумента.Организация;
		Движение.ФизЛицо                        = ВыборкаПоТЧ.ФизЛицо;
		Движение.СтавкаНалогообложенияРезидента = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка40;
		
		// Ресурсы
		Движение.СуммаНДФЛКЗачету = ВыборкаПоТЧ.СуммаВозвратаПоСтавке40;
	КонецЕсли;
	
	// Проведем возврат как отрицательный расход (отрицательное удержание налога) отдельно для каждой ставки
//толик изменил движения с расхода на приход как в начислении зарплаты для правильного расчета подоходного
//удалил движения по регистру налог к зачету
	Движения.НДФЛКЗачету.Очистить();
	
//	Если ВыборкаПоТЧ.СуммаВозвратаПоСтавке13 <> 0 Тогда
//		Движение = Движения.НДФЛРасчетыСБюджетом.Добавить();
//		// Свойства
//		Движение.Период                 = ВыборкаПоШапкеДокумента.Дата;
//		Движение.ВидДвижения			= ВидДвиженияНакопления.Расход;
//		// Измерения
//		Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
//		Движение.ФизЛицо                		= ВыборкаПоТЧ.ФизЛицо;
//		Движение.СтавкаНалогообложенияРезидента	= Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13;
//		Движение.МесяцНалоговогоПериода      	= ВыборкаПоШапкеДокумента.МесяцНалоговогоПериода;
//		// Ресурсы
//		Движение.Налог					= - ВыборкаПоТЧ.СуммаВозвратаПоСтавке13; 
//		// Реквизиты
//		Движение.ОбособленноеПодразделение  = ВыборкаПоШапкеДокумента.Организация;
//		Движение.ВидСтроки				= Перечисления.НДФЛРасчетыСБюджетомВидСтроки.ВозвратНалога;
//		//Движение.КодПоОКАТО				= ВыборкаПоТЧ.КодПоОКАТО; 
//		//Движение.КПП					= ВыборкаПоТЧ.КПП; 
//	КонецЕсли;
//	
//	Если ВыборкаПоТЧ.СуммаВозвратаПоСтавке09 <> 0 Тогда
//		Движение = Движения.НДФЛРасчетыСБюджетом.Добавить();
//		// Свойства
//		Движение.Период                 = ВыборкаПоШапкеДокумента.Дата;
//		Движение.ВидДвижения			= ВидДвиженияНакопления.Расход;
//		// Измерения
//		Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
//		Движение.ФизЛицо                		= ВыборкаПоТЧ.ФизЛицо;
//		Движение.СтавкаНалогообложенияРезидента	= Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка09;
//		Движение.МесяцНалоговогоПериода 		= ВыборкаПоШапкеДокумента.МесяцНалоговогоПериода;
//		// Ресурсы
//		Движение.Налог					= - ВыборкаПоТЧ.СуммаВозвратаПоСтавке09; 
//		// Реквизиты
//		Движение.ОбособленноеПодразделение  = ВыборкаПоШапкеДокумента.Организация;
//		Движение.ВидСтроки				= Перечисления.НДФЛРасчетыСБюджетомВидСтроки.ВозвратНалога;
//		//Движение.КодПоОКАТО				= ВыборкаПоТЧ.КодПоОКАТО; 
//		//Движение.КПП					= ВыборкаПоТЧ.КПП; 
//	КонецЕсли;
//	
//	Если ВыборкаПоТЧ.СуммаВозвратаПоСтавке35 <> 0 Тогда
//		Движение = Движения.НДФЛРасчетыСБюджетом.Добавить();
//		// Свойства
//		Движение.Период                 = ВыборкаПоШапкеДокумента.Дата;
//		Движение.ВидДвижения			= ВидДвиженияНакопления.Расход;
//		// Измерения
//		Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
//		Движение.ФизЛицо                		= ВыборкаПоТЧ.ФизЛицо;
//		Движение.СтавкаНалогообложенияРезидента	= Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка35;
//		Движение.МесяцНалоговогоПериода 		= ВыборкаПоШапкеДокумента.МесяцНалоговогоПериода;
//		// Ресурсы
//		Движение.Налог					= - ВыборкаПоТЧ.СуммаВозвратаПоСтавке35; 
//		// Реквизиты
//		Движение.ОбособленноеПодразделение  = ВыборкаПоШапкеДокумента.Организация;
//		Движение.ВидСтроки				= Перечисления.НДФЛРасчетыСБюджетомВидСтроки.ВозвратНалога;
//		//Движение.КодПоОКАТО				= ВыборкаПоТЧ.КодПоОКАТО; 
//		//Движение.КПП					= ВыборкаПоТЧ.КПП; 
//	КонецЕсли;
//	
//	Если ВыборкаПоТЧ.СуммаВозвратаПоСтавке9 <> 0 Тогда
//		Движение = Движения.НДФЛРасчетыСБюджетом.Добавить();
//		// Свойства
//		Движение.Период                 = ВыборкаПоШапкеДокумента.Дата;
//		Движение.ВидДвижения			= ВидДвиженияНакопления.Расход;
//		// Измерения
//		Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
//		Движение.ФизЛицо                		= ВыборкаПоТЧ.ФизЛицо;
//		Движение.СтавкаНалогообложенияРезидента	= Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка9;
//		Движение.МесяцНалоговогоПериода 		= ВыборкаПоШапкеДокумента.МесяцНалоговогоПериода;
//		// Ресурсы
//		Движение.Налог					= - ВыборкаПоТЧ.СуммаВозвратаПоСтавке9; 
//		// Реквизиты
//		Движение.ОбособленноеПодразделение  = ВыборкаПоШапкеДокумента.Организация;
//		Движение.ВидСтроки				= Перечисления.НДФЛРасчетыСБюджетомВидСтроки.ВозвратНалога;
//		//Движение.КодПоОКАТО				= ВыборкаПоТЧ.КодПоОКАТО; 
//		//Движение.КПП					= ВыборкаПоТЧ.КПП; 
//	КонецЕсли;
//	
//	Если ВыборкаПоТЧ.СуммаВозвратаПоСтавке40 <> 0 Тогда
//		Движение = Движения.НДФЛРасчетыСБюджетом.Добавить();
//		// Свойства
//		Движение.Период                 = ВыборкаПоШапкеДокумента.Дата;
//		Движение.ВидДвижения			= ВидДвиженияНакопления.Расход;
//		// Измерения
//		Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
//		Движение.ФизЛицо                		= ВыборкаПоТЧ.ФизЛицо;
//		Движение.СтавкаНалогообложенияРезидента	= Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка40;
//		Движение.МесяцНалоговогоПериода 		= ВыборкаПоШапкеДокумента.МесяцНалоговогоПериода;
//		// Ресурсы
//		Движение.Налог					= - ВыборкаПоТЧ.СуммаВозвратаПоСтавке40; 
//		// Реквизиты
//		Движение.ОбособленноеПодразделение  = ВыборкаПоШапкеДокумента.Организация;
//		Движение.ВидСтроки				= Перечисления.НДФЛРасчетыСБюджетомВидСтроки.ВозвратНалога;
//		//Движение.КодПоОКАТО				= ВыборкаПоТЧ.КодПоОКАТО; 
//		//Движение.КПП					= ВыборкаПоТЧ.КПП; 
//	КонецЕсли;

	Если ВыборкаПоТЧ.СуммаВозвратаПоСтавке13 <> 0 Тогда
		Движение = Движения.НДФЛРасчетыСБюджетом.Добавить();
		// Свойства
		Движение.Период                 = ВыборкаПоШапкеДокумента.Дата;
		Движение.ВидДвижения			= ВидДвиженияНакопления.Приход;
		// Измерения
		Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		Движение.ФизЛицо                		= ВыборкаПоТЧ.ФизЛицо;
		Движение.СтавкаНалогообложенияРезидента	= Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13;
		Движение.МесяцНалоговогоПериода      	= ВыборкаПоШапкеДокумента.МесяцНалоговогоПериода;
		// Ресурсы
		Движение.Налог					= - ВыборкаПоТЧ.СуммаВозвратаПоСтавке13; 
		// Реквизиты
		Движение.ОбособленноеПодразделение  = ВыборкаПоШапкеДокумента.Организация;
		Движение.ВидСтроки				= Перечисления.НДФЛРасчетыСБюджетомВидСтроки.Начисление;
		Движение.ИсчисленоИзЗарплаты = Истина;
		//Движение.КодПоОКАТО				= ВыборкаПоТЧ.КодПоОКАТО; 
		//Движение.КПП					= ВыборкаПоТЧ.КПП; 
	КонецЕсли;
	
	Если ВыборкаПоТЧ.СуммаВозвратаПоСтавке09 <> 0 Тогда
		Движение = Движения.НДФЛРасчетыСБюджетом.Добавить();
		// Свойства
		Движение.Период                 = ВыборкаПоШапкеДокумента.Дата;
		Движение.ВидДвижения			= ВидДвиженияНакопления.Приход;
		// Измерения
		Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		Движение.ФизЛицо                		= ВыборкаПоТЧ.ФизЛицо;
		Движение.СтавкаНалогообложенияРезидента	= Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка09;
		Движение.МесяцНалоговогоПериода 		= ВыборкаПоШапкеДокумента.МесяцНалоговогоПериода;
		// Ресурсы
		Движение.Налог					= - ВыборкаПоТЧ.СуммаВозвратаПоСтавке09; 
		// Реквизиты
		Движение.ОбособленноеПодразделение  = ВыборкаПоШапкеДокумента.Организация;
		Движение.ВидСтроки				= Перечисления.НДФЛРасчетыСБюджетомВидСтроки.Начисление;
		Движение.ИсчисленоИзЗарплаты = Истина;
		//Движение.КодПоОКАТО				= ВыборкаПоТЧ.КодПоОКАТО; 
		//Движение.КПП					= ВыборкаПоТЧ.КПП; 
	КонецЕсли;
	
	Если ВыборкаПоТЧ.СуммаВозвратаПоСтавке35 <> 0 Тогда
		Движение = Движения.НДФЛРасчетыСБюджетом.Добавить();
		// Свойства
		Движение.Период                 = ВыборкаПоШапкеДокумента.Дата;
		Движение.ВидДвижения			= ВидДвиженияНакопления.Приход;
		// Измерения
		Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		Движение.ФизЛицо                		= ВыборкаПоТЧ.ФизЛицо;
		Движение.СтавкаНалогообложенияРезидента	= Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка35;
		Движение.МесяцНалоговогоПериода 		= ВыборкаПоШапкеДокумента.МесяцНалоговогоПериода;
		// Ресурсы
		Движение.Налог					= - ВыборкаПоТЧ.СуммаВозвратаПоСтавке35; 
		// Реквизиты
		Движение.ОбособленноеПодразделение  = ВыборкаПоШапкеДокумента.Организация;
		Движение.ВидСтроки				= Перечисления.НДФЛРасчетыСБюджетомВидСтроки.Начисление;
		Движение.ИсчисленоИзЗарплаты = Истина;
		//Движение.КодПоОКАТО				= ВыборкаПоТЧ.КодПоОКАТО; 
		//Движение.КПП					= ВыборкаПоТЧ.КПП; 
	КонецЕсли;
	
	Если ВыборкаПоТЧ.СуммаВозвратаПоСтавке9 <> 0 Тогда
		Движение = Движения.НДФЛРасчетыСБюджетом.Добавить();
		// Свойства
		Движение.Период                 = ВыборкаПоШапкеДокумента.Дата;
		Движение.ВидДвижения			= ВидДвиженияНакопления.Приход;
		// Измерения
		Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		Движение.ФизЛицо                		= ВыборкаПоТЧ.ФизЛицо;
		Движение.СтавкаНалогообложенияРезидента	= Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка9;
		Движение.МесяцНалоговогоПериода 		= ВыборкаПоШапкеДокумента.МесяцНалоговогоПериода;
		// Ресурсы
		Движение.Налог					= - ВыборкаПоТЧ.СуммаВозвратаПоСтавке9; 
		// Реквизиты
		Движение.ОбособленноеПодразделение  = ВыборкаПоШапкеДокумента.Организация;
		Движение.ВидСтроки				= Перечисления.НДФЛРасчетыСБюджетомВидСтроки.Начисление;
		Движение.ИсчисленоИзЗарплаты = Истина;
		//Движение.КодПоОКАТО				= ВыборкаПоТЧ.КодПоОКАТО; 
		//Движение.КПП					= ВыборкаПоТЧ.КПП; 
	КонецЕсли;
	
	Если ВыборкаПоТЧ.СуммаВозвратаПоСтавке40 <> 0 Тогда
		Движение = Движения.НДФЛРасчетыСБюджетом.Добавить();
		// Свойства
		Движение.Период                 = ВыборкаПоШапкеДокумента.Дата;
		Движение.ВидДвижения			= ВидДвиженияНакопления.Приход;
		// Измерения
		Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		Движение.ФизЛицо                		= ВыборкаПоТЧ.ФизЛицо;
		Движение.СтавкаНалогообложенияРезидента	= Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка40;
		Движение.МесяцНалоговогоПериода 		= ВыборкаПоШапкеДокумента.МесяцНалоговогоПериода;
		// Ресурсы
		Движение.Налог					= - ВыборкаПоТЧ.СуммаВозвратаПоСтавке40; 
		// Реквизиты
		Движение.ОбособленноеПодразделение  = ВыборкаПоШапкеДокумента.Организация;
		Движение.ВидСтроки				= Перечисления.НДФЛРасчетыСБюджетомВидСтроки.Начисление;
		Движение.ИсчисленоИзЗарплаты = Истина;
		//Движение.КодПоОКАТО				= ВыборкаПоТЧ.КодПоОКАТО; 
		//Движение.КПП					= ВыборкаПоТЧ.КПП; 
	КонецЕсли;

	// Проведем возврат как отрицательный расход (отрицательное удержание налога) отюдельно для каждой ставки
	
	Если ВыборкаПоТЧ.СуммаВозвратаПоСтавке13 <> 0 Тогда
		Движение = Движения.ВзаиморасчетыСРаботникамиОрганизаций.Добавить();
		// Свойства
		Движение.Период           				= ВыборкаПоШапкеДокумента.Дата;
		Движение.ВидДвижения					= ВидДвиженияНакопления.Приход;
		// Измерения
		Движение.Организация					= ВыборкаПоШапкеДокумента.Организация;
		Движение.ФизЛицо                		= ВыборкаПоТЧ.ФизЛицо;
		Если УчетЗадолженностиПоМесяцам Тогда
			Движение.ПериодВзаиморасчетов           = ВыборкаПоШапкеДокумента.МесяцНалоговогоПериода;
		КонецЕсли;
		
		// Ресурсы
		Движение.СуммаВзаиморасчетов			= ВыборкаПоТЧ.СуммаВозвратаПоСтавке13; 
	КонецЕсли;
	
	Если ВыборкаПоТЧ.СуммаВозвратаПоСтавке09 <> 0 Тогда
		Движение = Движения.ВзаиморасчетыСРаботникамиОрганизаций.Добавить();
		// Свойства
		Движение.Период           				= ВыборкаПоШапкеДокумента.Дата;
		Движение.ВидДвижения					= ВидДвиженияНакопления.Приход;
		// Измерения
		Движение.Организация					= ВыборкаПоШапкеДокумента.Организация;
		Движение.ФизЛицо                		= ВыборкаПоТЧ.ФизЛицо;
		Если УчетЗадолженностиПоМесяцам Тогда
			Движение.ПериодВзаиморасчетов           = ВыборкаПоШапкеДокумента.МесяцНалоговогоПериода;
		КонецЕсли;
		
		// Ресурсы
		Движение.СуммаВзаиморасчетов			= ВыборкаПоТЧ.СуммаВозвратаПоСтавке09; 
	КонецЕсли;
	
	Если ВыборкаПоТЧ.СуммаВозвратаПоСтавке35 <> 0 Тогда
		Движение = Движения.ВзаиморасчетыСРаботникамиОрганизаций.Добавить();
		// Свойства
		Движение.Период           				= ВыборкаПоШапкеДокумента.Дата;
		Движение.ВидДвижения					= ВидДвиженияНакопления.Приход;
		// Измерения
		Движение.Организация					= ВыборкаПоШапкеДокумента.Организация;
		Движение.ФизЛицо                		= ВыборкаПоТЧ.ФизЛицо;
		Если УчетЗадолженностиПоМесяцам Тогда
			Движение.ПериодВзаиморасчетов           = ВыборкаПоШапкеДокумента.МесяцНалоговогоПериода;
		КонецЕсли;
		
		// Ресурсы
		Движение.СуммаВзаиморасчетов			= ВыборкаПоТЧ.СуммаВозвратаПоСтавке35; 
	КонецЕсли;
	
	Если ВыборкаПоТЧ.СуммаВозвратаПоСтавке9 <> 0 Тогда
		Движение = Движения.ВзаиморасчетыСРаботникамиОрганизаций.Добавить();
		// Свойства
		Движение.Период           				= ВыборкаПоШапкеДокумента.Дата;
		Движение.ВидДвижения					= ВидДвиженияНакопления.Приход;
		// Измерения
		Движение.Организация					= ВыборкаПоШапкеДокумента.Организация;
		Движение.ФизЛицо                		= ВыборкаПоТЧ.ФизЛицо;
		Если УчетЗадолженностиПоМесяцам Тогда
			Движение.ПериодВзаиморасчетов           = ВыборкаПоШапкеДокумента.МесяцНалоговогоПериода;
		КонецЕсли;
		
		// Ресурсы
		Движение.СуммаВзаиморасчетов			= ВыборкаПоТЧ.СуммаВозвратаПоСтавке9; 
	КонецЕсли;
	
	Если ВыборкаПоТЧ.СуммаВозвратаПоСтавке40 <> 0 Тогда
		Движение = Движения.ВзаиморасчетыСРаботникамиОрганизаций.Добавить();
		// Свойства
		Движение.Период           				= ВыборкаПоШапкеДокумента.Дата;
		Движение.ВидДвижения					= ВидДвиженияНакопления.Приход;
		// Измерения
		Движение.Организация					= ВыборкаПоШапкеДокумента.Организация;
		Движение.ФизЛицо                		= ВыборкаПоТЧ.ФизЛицо;
		Если УчетЗадолженностиПоМесяцам Тогда
			Движение.ПериодВзаиморасчетов           = ВыборкаПоШапкеДокумента.МесяцНалоговогоПериода;
		КонецЕсли;
		
		// Ресурсы
		Движение.СуммаВзаиморасчетов			= ВыборкаПоТЧ.СуммаВозвратаПоСтавке40; 
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамНакопления

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке(Режим);

	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();

	Если ВыборкаПоШапкеДокумента.Следующий() Тогда

		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);

		// Движения стоит добавлять, если в проведении еще не отказано (отказ = ложь)
		Если НЕ Отказ Тогда

			// ведется ли учет задолженности в разрезе периодов возникновения задолженности
			УчетЗадолженностиПоМесяцам	= ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "УчетЗадолженностиПоМесяцам");

			// получим реквизиты табличной части
			ВыборкаПоРаботникиОрганизации = СформироватьЗапросПоРаботникиОрганизации(Режим).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

			Пока ВыборкаПоРаботникиОрганизации.Следующий() Цикл 

				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиРаботникиОрганизации(ВыборкаПоРаботникиОрганизации, Отказ, Заголовок);
				
				// Заполним записи в наборах записей регистров
				ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизации, УчетЗадолженностиПоМесяцам);

			КонецЦикла;
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(РаботникиОрганизации,, "Физлицо");
	
	Если Не ОбменДанными.Загрузка Тогда
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение  Тогда
			
			ЭтоНеЮрЛицо = Не Организация.ЮрФизЛицо <> Перечисления.ЮрФизЛицо.ФизЛицо;
			
			Для каждого СтрокаТЧ Из РаботникиОрганизации Цикл
				Если ЭтоНеЮрЛицо Тогда
					СтрокаТЧ.КодПоОКАТО = "";
					СтрокаТЧ.КПП = "";
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
